app/Models/AdminModel.php

SELECT COUNT(*) AS `numrows` FROM `pacientes`
SELECT COUNT(*) AS `numrows` FROM `medicos`
SELECT COUNT(*) AS `numrows` FROM `secretarios`
SELECT COUNT(*) AS `numrows`
FROM `agendamentos`
WHERE `Data_Agendamento` = '2026-09-10'
AND `Status` != 'Cancelado'
SELECT COUNT(*) AS `numrows`
FROM `agendamentos`
WHERE `Data_Agendamento` > '2026-09-10'
AND `Status` != 'Cancelado'
---
    public function getMetrics()
    {
        $db = \Config\Database::connect();

        $metrics = [];

        // Total de pacientes
        $builder = $db->table('pacientes');
        $metrics['total_patients'] = $builder->countAll();

        // Total de médicos
        $builder = $db->table('medicos');
        $metrics['total_doctors'] = $builder->countAll();

        // Total de secretários
        $builder = $db->table('secretarios');
        $metrics['total_secretaries'] = $builder->countAll();

        // Agendamentos de hoje
        $today = date('Y-m-d');
        $builder = $db->table('agendamentos');
        $builder->where('Data_Agendamento', $today);
        $builder->where('Status !=', 'Cancelado');
        $metrics['appointments_today'] = $builder->countAllResults();

        // Agendamentos futuros (data > hoje)
        $builder = $db->table('agendamentos');
        $builder->where('Data_Agendamento >', $today);
        $builder->where('Status !=', 'Cancelado');
        $metrics['upcoming_appointments'] = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `agendamentos`
WHERE `Status` = 'Cancelado'
---
        // Agendamentos cancelados
        $builder = $db->table('agendamentos');
        $builder->where('Status', 'Cancelado');
        $metrics['cancelled_appointments'] = $builder->countAllResults();

SELECT *
FROM `pacientes`
ORDER BY `Nome` ASC
---
    public function getPacientes()
    {
        $builder = $this->db->table('pacientes');
        $builder->orderBy('Nome', 'ASC');
        return $builder->get()->getResult();

SELECT *
FROM `medicos`
ORDER BY `Nome` ASC
---
    public function getMedicos()
    {
        $builder = $this->db->table('medicos');
        $builder->orderBy('Nome', 'ASC');
        return $builder->get()->getResult();

SELECT `a`.*, `p`.`Nome` as `paciente_nome`, `p`.`Sobrenome` as `paciente_sobrenome`, `m`.`Nome` as `medico_nome`, `m`.`Sobrenome` as `medico_sobrenome`, `e`.`Nome` as `especialidade`
FROM `agendamentos` `a`
LEFT JOIN `pacientes` `p` ON `p`.`ID_Paciente` = `a`.`ID_Paciente`
LEFT JOIN `medicos` `m` ON `m`.`ID_Medico` = `a`.`ID_Medico`
LEFT JOIN `especialidades` `e` ON `e`.`ID_Especialidade` = `m`.`ID_Especialidade`
ORDER BY `a`.`Data_Agendamento` DESC
---
    public function getAgendamentos()
    {
        $builder = $this->db->table('agendamentos a');
        $builder->select('
            a.*,
            p.Nome as paciente_nome,
            p.Sobrenome as paciente_sobrenome,
            m.Nome as medico_nome,
            m.Sobrenome as medico_sobrenome,
            e.Nome as especialidade
        ');
        $builder->join('pacientes p', 'p.ID_Paciente = a.ID_Paciente', 'left');
        $builder->join('medicos m', 'm.ID_Medico = a.ID_Medico', 'left');
        $builder->join('especialidades e', 'e.ID_Especialidade = m.ID_Especialidade', 'left');
        $builder->orderBy('a.Data_Agendamento', 'DESC');
        return $builder->get()->getResult();

SELECT *
FROM `pacientes`
ORDER BY `Criado_Em` DESC
 LIMIT 5
---
    public function getRecentActivity($search = '')
    {
        $activities = [];

        // Buscar pacientes recentes
        $builder = $this->db->table('pacientes');
        if (!empty($search)) {
            $builder->groupStart()
                ->like('Nome', $search)
                ->orLike('Sobrenome', $search)
                ->orLike('BI', $search)
                ->orLike('Telefone', $search)
                ->groupEnd();
        }
        $builder->orderBy('Criado_Em', 'DESC');
        $builder->limit(5);
        $patients = $builder->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `agendamentos`
WHERE `Data_Agendamento` = '2026-08-28'
---
    public function getAppointmentsTrend()
    {
        $db = \Config\Database::connect();

        $labels = [];
        $data = [];

        for ($i = 13; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $labels[] = date('d/m', strtotime($date));

            $builder = $db->table('agendamentos');
            $builder->where('Data_Agendamento', $date);
            $count = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `agendamentos`
WHERE LOWER(Status) = 'pendente'
---
    public function getAppointmentsStatus()
    {
        $db = \Config\Database::connect();

        $statuses = ['pendente', 'confirmado', 'cancelado'];
        $result = [];

        foreach ($statuses as $status) {
            $builder = $db->table('agendamentos');
            $builder->where('LOWER(Status)', $status);
            $result[$status] = $builder->countAllResults();

SELECT `e`.`Nome` as `specialty`, COUNT(m.ID_Medico) as total
FROM `medicos` `m`
LEFT JOIN `especialidades` `e` ON `e`.`ID_Especialidade` = `m`.`ID_Especialidade`
WHERE `m`.`ID_Especialidade` > 0
GROUP BY `m`.`ID_Especialidade`
ORDER BY `total` DESC
 LIMIT 10
---
    public function getDoctorsBySpecialty()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('medicos m');
        $builder->select('e.Nome as specialty, COUNT(m.ID_Medico) as total');
        $builder->join('especialidades e', 'e.ID_Especialidade = m.ID_Especialidade', 'left');
        $builder->where('m.ID_Especialidade >', 0);
        $builder->groupBy('m.ID_Especialidade');
        $builder->orderBy('total', 'DESC');
        $builder->limit(10);

        $results = $builder->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `pacientes`
WHERE `Criado_Em` >= '2026-04-01'
AND `Criado_Em` <= '2026-04-30 23:59:59'
---
    public function getPatientsMonthly()
    {
        $db = \Config\Database::connect();

        $labels = [];
        $data = [];

        for ($i = 5; $i >= 0; $i--) {
            $month = date('Y-m', strtotime("-$i months"));
            $labels[] = date('M/Y', strtotime($month . '-01'));

            $startDate = $month . '-01';
            $endDate = date('Y-m-t', strtotime($month . '-01'));

            $builder = $db->table('pacientes');
            $builder->where('Criado_Em >=', $startDate);
            $builder->where('Criado_Em <=', $endDate . ' 23:59:59');
            $count = $builder->countAllResults();

SELECT *
FROM `pacientes`
WHERE `BI` = '257985229875'
---
    public function deletePatient($bi)
    {
        // Buscar paciente pelo BI
        $builder = $this->db->table('pacientes');
        $patient = $builder->where('BI', $bi)->get()->getRow();

SELECT `a`.*, CONCAT(p.Nome, " ", p.Sobrenome) as paciente, CONCAT(m.Nome, " ", m.Sobrenome) as medico, `e`.`Nome` as `especialidade`, `p`.`Data_Nascimento` as `paciente_data_nasc`, `p`.`Telefone` as `paciente_telefone`, `p`.`BI` as `paciente_bi`, `p`.`Endereco` as `paciente_endereco`, `p`.`Genero` as `paciente_genero`
FROM `agendamentos` `a`
LEFT JOIN `pacientes` `p` ON `p`.`ID_Paciente` = `a`.`ID_Paciente`
LEFT JOIN `medicos` `m` ON `m`.`ID_Medico` = `a`.`ID_Medico`
LEFT JOIN `especialidades` `e` ON `e`.`ID_Especialidade` = `m`.`ID_Especialidade`
WHERE `a`.`ID_Agendamento` = '25'
---
    public function getAppointmentDetails($id)
    {
        try {
            $builder = $this->db->table('agendamentos a');
            $builder->select('
            a.*,
            CONCAT(p.Nome, " ", p.Sobrenome) as paciente,
            CONCAT(m.Nome, " ", m.Sobrenome) as medico,
            e.Nome as especialidade,
            p.Data_Nascimento as paciente_data_nasc,
            p.Telefone as paciente_telefone,
            p.BI as paciente_bi,
            p.Endereco as paciente_endereco,
            p.Genero as paciente_genero
        ');
            $builder->join('pacientes p', 'p.ID_Paciente = a.ID_Paciente', 'left');
            $builder->join('medicos m', 'm.ID_Medico = a.ID_Medico', 'left');
            $builder->join('especialidades e', 'e.ID_Especialidade = m.ID_Especialidade', 'left');
            $builder->where('a.ID_Agendamento', $id);
            $result = $builder->get()->getRow();

SELECT `h`.*, `m`.`Nome` as `medico_nome`, `m`.`Sobrenome` as `medico_sobrenome`, `m`.`Especialidade`, `e`.`Nome` as `especialidade`
FROM `horarios` `h`
LEFT JOIN `medicos` `m` ON `m`.`ID_Medico` = `h`.`ID_Medico`
LEFT JOIN `especialidades` `e` ON `e`.`ID_Especialidade` = `m`.`ID_Especialidade`
ORDER BY `h`.`Dia_Semana` ASC, `h`.`Hora_Inicio` ASC
---
    public function getHorarios()
    {
        try {
            $builder = $this->db->table('horarios h');
            $builder->select('
            h.*,
            m.Nome as medico_nome,
            m.Sobrenome as medico_sobrenome,
            m.Especialidade,
            e.Nome as especialidade
        ');
            $builder->join('medicos m', 'm.ID_Medico = h.ID_Medico', 'left');
            $builder->join('especialidades e', 'e.ID_Especialidade = m.ID_Especialidade', 'left');
            $builder->orderBy('h.Dia_Semana', 'ASC');
            $builder->orderBy('h.Hora_Inicio', 'ASC');

            $results = $builder->get()->getResult();