app/Models/AdminModel.php

SELECT COUNT(*) AS `numrows`
FROM `agendamentos`
WHERE `Data_Agendamento` = '2026-07-20'
---
    public function getAppointmentsTrend()
    {
        $db = \Config\Database::connect();

        $labels = [];
        $data = [];

        for ($i = 13; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $labels[] = date('d/m', strtotime($date));

            $builder = $db->table('agendamentos');
            $builder->where('Data_Agendamento', $date);
            $count = $builder->countAllResults();

SELECT `e`.`Nome` as `specialty`, COUNT(m.ID_Medico) as total
FROM `medicos` `m`
LEFT JOIN `especialidades` `e` ON `e`.`ID_Especialidade` = `m`.`ID_Especialidade`
WHERE `m`.`ID_Especialidade` > 0
GROUP BY `m`.`ID_Especialidade`
ORDER BY `total` DESC
 LIMIT 10
---
    public function getDoctorsBySpecialty()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('medicos m');
        $builder->select('e.Nome as specialty, COUNT(m.ID_Medico) as total');
        $builder->join('especialidades e', 'e.ID_Especialidade = m.ID_Especialidade', 'left');
        $builder->where('m.ID_Especialidade >', 0);
        $builder->groupBy('m.ID_Especialidade');
        $builder->orderBy('total', 'DESC');
        $builder->limit(10);

        $results = $builder->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `pacientes`
WHERE `Criado_Em` >= '2026-03-01'
AND `Criado_Em` <= '2026-03-31 23:59:59'
---
    public function getPatientsMonthly()
    {
        $db = \Config\Database::connect();

        $labels = [];
        $data = [];

        for ($i = 5; $i >= 0; $i--) {
            $month = date('Y-m', strtotime("-$i months"));
            $labels[] = date('M/Y', strtotime($month . '-01'));

            $startDate = $month . '-01';
            $endDate = date('Y-m-t', strtotime($month . '-01'));

            $builder = $db->table('pacientes');
            $builder->where('Criado_Em >=', $startDate);
            $builder->where('Criado_Em <=', $endDate . ' 23:59:59');
            $count = $builder->countAllResults();

SELECT *
FROM `pacientes`
ORDER BY `Nome` ASC
---
    public function getPatients($query = '')
    {
        $builder = $this->db->table('pacientes');

        if (!empty($query)) {
            $builder->groupStart()
                ->like('Nome', $query)
                ->orLike('Sobrenome', $query)
                ->orLike('BI', $query)
                ->orLike('Telefone', $query)
                ->groupEnd();
        }

        $builder->orderBy('Nome', 'ASC');
        $results = $builder->get()->getResult();

SELECT *
FROM `medicos`
ORDER BY `Nome` ASC
---
    public function getDoctorsList($query = '')
    {
        $builder = $this->db->table('medicos');

        if (!empty($query)) {
            $builder->groupStart()
                ->like('Nome', $query)
                ->orLike('Sobrenome', $query)
                ->orLike('Especialidade', $query)
                ->orLike('Numero_Licenca', $query)
                ->orLike('Telefone', $query)
                ->groupEnd();
        }

        $builder->orderBy('Nome', 'ASC');
        $results = $builder->get()->getResult();