app/Models/AuthModel.php

    public function getPacienteByEmail($email)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pacientes p');
        $builder->join('usuarios u', 'u.ID_Referencia = p.ID_Paciente');
        $builder->where('u.Email', $email);
        return $builder->get()->getRow();
---
SELECT *
FROM `usuarios`
WHERE `Email` = 'gomesarcher3@gmail.com'